Revit 2026 API

# DocumentPrint(ViewSet, View, Boolean) Method

---

Prints a set of views with a specified view template and default print settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Print(
	ViewSet views,
	View viewTemplate,
	bool useCurrentPrintSettings
)
```
```vb
Public Sub Print (
	views As ViewSet,
	viewTemplate As View,
	useCurrentPrintSettings As Boolean
)
```
```cpp
public:
void Print(
	ViewSet^ views,
	View^ viewTemplate,
	bool useCurrentPrintSettings
)
```
```fsharp
member Print :
        views : ViewSet *
        viewTemplate : View *
        useCurrentPrintSettings : bool -> unit
```

#### Parameters

views ViewSet
    The set of views which need to be printed.
viewTemplate View
    The view template which apply to the set of views.
useCurrentPrintSettings Boolean
    If true, print the view with the current print setting, otherwise with the print setting of the document of the view.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when printing is not allowed in the current application mode. Or when at least one view from the view set is not a printable view. |
| ArgumentNullException | Thrown when the view set to be printed is . |
| ArgumentException | Thrown when the view set contains a  element. |
| ApplicationException | Thrown when at least one view from the view set could not be printed. |
| OperationCanceledException | Thrown when print is cancelled by event handler. |

If one view in the set can not be printed successfully then an exception will be thrown.

#### Reference

Document Class

Print Overload

Autodesk.Revit.DB Namespace